#a = int(input())
#print(a)
#print ("введите радиус ")
#f = int(input())
#print (3.14*(f**2))
#a = 1
#b = 1
#if a == b:
#    print("ИСТИНА")
#else:
#    print("Лож")    
# оператор вводит стороны прямоугольника.  он вводит площадь этого прямоугольника и программа говорит верно ли это/ программа выводит верное значение в слуаче ошибки
#print ("введите сторону А")
#a = int(input())
#print ("введите сторону B")
#b = int(input())
#print ("введите площадь")
#c = int(input())
#s=a*b
#x=s-1
#if s==c:
# print("верно")
#elif x==c:
# print("Почти верно")
#    
#else:
#     print("упс. верно будет " )
#     print( s )

#x=0
#while x != 100:
#    print(x)
#    x = x+1
#Вывести все четные числа от 0 до 100 включительно)
x = 0
while x != 101:
    y=x%2
    if y==0:
        print(x)
    x = x+1
 #1.есть кирпичь с тремя сторонами. пользователь вносит их. и есть окно. надо понять вылетит ли  керпичь в окно.
    # программа генерирует число елочисленно от 1 до 10 и пользователь должен его угодать. если чсило верное то программа пишет молодец не молодец
       # программа генерирует число елочисленно от 1 до 10 и пользователь должен его угодать. еслип ользователь ошибся на одно число программа пишет "почти"
    # трни полдьзогвателя по очереди вводят число от 1 до 10. и программа выводит какие пользователи совпали. ккие пользователи назвали одинаковые числа.
    # игра в города. два игрока вводят наазвания городов  надо проверять верно ли
    # подсказки. рандомайзер. научиться от строки отрезать буквы. 
